CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Basic(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 receive data source select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTE0 (number 1), IMC_UART_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_INTERMCUCOMM_IMC_UART_TX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_INTERMCUCOMM_IMC_UART_TX_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_INTERMCUCOMM_IMC_UART_TX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTE1 (number 2), IMC_UART_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_INTERMCUCOMM_IMC_UART_RX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_INTERMCUCOMM_IMC_UART_RX_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_INTERMCUCOMM_IMC_UART_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_InterMcuComm(void);

/*!
 * @brief FTM3 channel 0 output source: FTM3_CH0 pin is output of FTM3 channel 0 output */
#define SOPT8_FTM3OCH0SRC_FTM 0x00u
/*!
 * @brief FTM3 channel 1 output source: FTM3_CH1 pin is output of FTM3 channel 1 output */
#define SOPT8_FTM3OCH1SRC_FTM 0x00u
/*!
 * @brief FTM3 channel 2 output source: FTM3_CH2 pin is output of FTM3 channel 2 output */
#define SOPT8_FTM3OCH2SRC_FTM 0x00u
/*!
 * @brief FTM3 channel 3 output source: FTM3_CH3 pin is output of FTM3 channel 3 output */
#define SOPT8_FTM3OCH3SRC_FTM 0x00u
/*!
 * @brief FTM3 channel 4 output source: FTM3_CH4 pin is output of FTM3 channel 4 output */
#define SOPT8_FTM3OCH4SRC_FTM 0x00u
/*!
 * @brief FTM3 channel 5 output source: FTM3_CH5 pin is output of FTM3 channel 5 output */
#define SOPT8_FTM3OCH5SRC_FTM 0x00u

/*! @name PORTE5 (number 8), CLED_LR
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_CLED_CLED_LR_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_CLED_CLED_LR_PIN 5U                   /*!<@brief PORT pin number */
#define RTEPIN_CLED_CLED_LR_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE6 (number 9), CLED_LG
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_CLED_CLED_LG_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_CLED_CLED_LG_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_CLED_CLED_LG_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE7 (number 10), CLED_LB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_CLED_CLED_LB_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_CLED_CLED_LB_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_CLED_CLED_LB_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE8 (number 11), CLED_RR
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_CLED_CLED_RR_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_CLED_CLED_RR_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_CLED_CLED_RR_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE9 (number 12), CLED_RG
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_CLED_CLED_RG_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_CLED_CLED_RG_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_CLED_CLED_RG_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE10 (number 13), CLED_RB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_CLED_CLED_RB_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_CLED_CLED_RB_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_CLED_CLED_RB_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_CLED(void);

/*! @name PORTE16 (number 18), EMAG_EWL
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_EMAG_EMAG_EWL_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_EMAG_EMAG_EWL_PIN 16U                   /*!<@brief PORT pin number */
#define RTEPIN_EMAG_EMAG_EWL_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE17 (number 19), EMAG_EXL
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_EMAG_EMAG_EXL_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_EMAG_EMAG_EXL_PIN 17U                   /*!<@brief PORT pin number */
#define RTEPIN_EMAG_EMAG_EXL_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE18 (number 20), EMAG_EWR
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_EMAG_EMAG_EWR_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_EMAG_EMAG_EWR_PIN 18U                   /*!<@brief PORT pin number */
#define RTEPIN_EMAG_EMAG_EWR_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE19 (number 21), EMAG_EXR
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_EMAG_EMAG_EXR_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_EMAG_EMAG_EXR_PIN 19U                   /*!<@brief PORT pin number */
#define RTEPIN_EMAG_EMAG_EXR_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                       /* @} */

