CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.h
/*! @name HSADC1A_CH2 (number 27), EMAG_EYLF
  @{ */
/* @} */

/*! @name HSADC1A_CH3 (number 28), EMAG_EZLF
  @{ */
/* @} */

/*! @name HSADC1B_CH2 (number 29), EMAG_EYRF
  @{ */
/* @} */

/*! @name HSADC1B_CH3 (number 30), EMAG_EZRF
  @{ */
/* @} */

/*! @name HSADC0A_CH6 (number 23), EMAG_EYL
  @{ */
/* @} */

/*! @name HSADC0A_CH7 (number 24), EMAG_EZL
  @{ */
/* @} */

/*! @name PORTE20 (number 25), EMAG_EYR
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_EMAG_EMAG_EYR_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_EMAG_EMAG_EYR_PIN 20U                   /*!<@brief PORT pin number */
#define RTEPIN_EMAG_EMAG_EYR_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE21 (number 26), EMAG_EZR
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_EMAG_EMAG_EZR_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_EMAG_EMAG_EZR_PIN 21U                   /*!<@brief PORT pin number */
#define RTEPIN_EMAG_EMAG_EZR_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_EMAG(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTA1 (number 51), DBG_UART_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DEBUG_DBG_UART_RX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DEBUG_DBG_UART_RX_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_DEBUG_DBG_UART_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA2 (number 52), DBG_UART_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DEBUG_DBG_UART_TX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DEBUG_DBG_UART_TX_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_DEBUG_DBG_UART_TX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA0 (number 50), DBG_TCK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DEBUG_DBG_TCK_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DEBUG_DBG_TCK_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_DEBUG_DBG_TCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA3 (number 53), DBT_TMS
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DEBUG_DBT_TMS_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DEBUG_DBT_TMS_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_DEBUG_DBT_TMS_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Debug(void);

/*! @name PORTA7 (number 59), TOF0_XHT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_TOFSENSOR_TOF0_XHT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF0_XHT_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOF0_XHT_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF0_XHT_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOF0_XHT_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTA8 (number 60), TOF0_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_TOFSENSOR_TOF0_INT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF0_INT_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOF0_INT_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF0_INT_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOF0_INT_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTA9 (number 61), TOF1_XHT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_TOFSENSOR_TOF1_XHT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF1_XHT_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOF1_XHT_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF1_XHT_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOF1_XHT_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTA10 (number 62), TOF1_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_TOFSENSOR_TOF1_INT_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF1_INT_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOF1_INT_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF1_INT_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOF1_INT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA11 (number 63), TOF2_XHT
  @{ */

