CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_TOFSENSOR_TOF2_XHT_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF2_XHT_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOF2_XHT_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF2_XHT_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOF2_XHT_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA12 (number 64), TOF2_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_TOFSENSOR_TOF2_INT_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF2_INT_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOF2_INT_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOF2_INT_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOF2_INT_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA13 (number 65), TOFn_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOFn_SDA_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOFn_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOFn_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA14 (number 66), TOFn_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_TOFSENSOR_TOFn_SCL_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_TOFSENSOR_TOFn_SCL_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_TOFSENSOR_TOFn_SCL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_TofSensor(void);

/*! @name PORTA28 (number 79), TCS_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_IMUTCSSENSOR_TCS_INT_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_IMUTCSSENSOR_TCS_INT_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_IMUTCSSENSOR_TCS_INT_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_IMUTCSSENSOR_TCS_INT_PIN 28U                   /*!<@brief PORT pin number */
#define RTEPIN_IMUTCSSENSOR_TCS_INT_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTA29 (number 80), IMU_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_IMUTCSSENSOR_IMU_INT_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_IMUTCSSENSOR_IMU_INT_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_IMUTCSSENSOR_IMU_INT_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_IMUTCSSENSOR_IMU_INT_PIN 29U                   /*!<@brief PORT pin number */
#define RTEPIN_IMUTCSSENSOR_IMU_INT_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTB0 (number 81), IMU_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_IMUTCSSENSOR_IMU_SCL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_IMUTCSSENSOR_IMU_SCL_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_IMUTCSSENSOR_IMU_SCL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTB1 (number 82), IMU_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_IMUTCSSENSOR_IMU_SDA_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_IMUTCSSENSOR_IMU_SDA_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_IMUTCSSENSOR_IMU_SDA_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_ImuTcsSensor(void);

/*! @name PORTD15 (number 144), KEY_SW03
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW03_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW03_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW03_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW03_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW03_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD14 (number 143), KEY_SW04
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW04_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW04_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW04_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW04_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW04_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD13 (number 142), KEY_SW02
  @{ */

