CkovMk/HITSIC_KV58F24/HITSIC_KV58F24_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW02_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW02_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW02_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW02_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW02_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD12 (number 141), KEY_SW05
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW05_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW05_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW05_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW05_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW05_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD11 (number 140), KEY_SW01
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW01_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW01_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW01_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW01_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW01_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD10 (number 139), KEY_SW06
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW06_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW06_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW06_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW06_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW06_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD9 (number 138), KEY_SW
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW00_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW00_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW00_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW00_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW00_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD8 (number 137), KEY_SW07
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_SWITCH_KEY_SW07_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW07_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_SWITCH_KEY_SW07_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_SWITCH_KEY_SW07_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_SWITCH_KEY_SW07_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Switch(void);

/*! @name PORTC14 (number 119), AUX_UART4_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_AUXUART_AUX_UART4_RX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_AUXUART_AUX_UART4_RX_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_AUXUART_AUX_UART4_RX_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTC15 (number 120), AUX_UART4_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_AUXUART_AUX_UART4_TX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_AUXUART_AUX_UART4_TX_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_AUXUART_AUX_UART4_TX_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTC16 (number 123), AUX_UART3_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_AUXUART_AUX_UART3_RX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_AUXUART_AUX_UART3_RX_PIN 16U                   /*!<@brief PORT pin number */
#define RTEPIN_AUXUART_AUX_UART3_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTC17 (number 124), AUX_UART3_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_AUXUART_AUX_UART3_TX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_AUXUART_AUX_UART3_TX_PIN 17U                   /*!<@brief PORT pin number */
#define RTEPIN_AUXUART_AUX_UART3_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTD2 (number 129), AUX_UART2_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_AUXUART_AUX_UART2_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_AUXUART_AUX_UART2_RX_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_AUXUART_AUX_UART2_RX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTD3 (number 130), AUX_UART2_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_AUXUART_AUX_UART2_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_AUXUART_AUX_UART2_TX_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_AUXUART_AUX_UART2_TX_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_AuxUart(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
